# RepeaterCoordinates Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RepeaterCoordinates Constructor
RepeaterCoordinates Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RepeaterCoordinates()()()() | Creates zero dimensional coordinates. |
| RepeaterCoordinates(Int32) | Creates one dimensional coordinates. |
| RepeaterCoordinates(Int32, Int32) | Creates two dimensional coordinates. |

# See Also
RepeaterCoordinates Class
RepeaterCoordinates Members
Autodesk.Revit.DB Namespace